Revit 2027 API
ExternalDataManagerCommand.RegisterCommand Method
 Registers a command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RegisterCommand(
	ExternalDataManagerCommand command
)
Public Shared Sub RegisterCommand (
	command As ExternalDataManagerCommand
)
public:
static void RegisterCommand(
	ExternalDataManagerCommand^ command
)
static member RegisterCommand :
        command : ExternalDataManagerCommand -> unit
Parameters
command ExternalDataManagerCommand
 The command to be registered.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This overload is intended to be used by external servers that already have a fully-constructed ExternalDataManagerCommand instance. The service copies the supplied metadata and adds the command to the global registry.
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace